app/controllers/admin/content_blocks_controller.rb

SELECT "content_blocks".* FROM "content_blocks" ORDER BY "content_blocks"."placement" ASC, "content_blocks"."key" ASC
---
    def index
      @content_blocks = ContentBlock.order(:placement, :key)