app/controllers/admin/coupons_controller.rb

    def index
      @coupons = Coupon.order(created_at: :desc)
---
SELECT "coupons".* FROM "coupons" ORDER BY "coupons"."created_at" DESC