app/controllers/admin/customers_controller.rb

    def index
      @customers = User.where(role: "customer").order(created_at: :desc)
---
SELECT "users".* FROM "users" WHERE "users"."role" = 'customer' ORDER BY "users"."created_at" DESC