app/controllers/admin/dashboard_controller.rb

SELECT COUNT(*) FROM "vehicles"
SELECT COUNT(*) FROM "reservations" WHERE "reservations"."status" = 'Requested'
SELECT COUNT(*) FROM "reservations" WHERE "reservations"."status" = 'active'
SELECT COUNT(*) FROM "reservations" WHERE "reservations"."status" = 'active' AND (dropoff_date < '2026-05-25')
SELECT COUNT(*) FROM "maintenance_logs" WHERE "maintenance_logs"."status" IN ('Scheduled', 'Overdue') AND (scheduled_on <= '2026-06-01')
SELECT SUM("reservations"."deposit_amount") FROM "reservations" WHERE "reservations"."deposit_status" = 'Paid'
SELECT SUM("payments"."amount") FROM "payments" WHERE "payments"."status" = 'Paid' AND "payments"."paid_at" BETWEEN '2026-05-01 00:00:00' AND '2026-05-31 23:59:59.999999'
SELECT "vehicles".* FROM "vehicles"
SELECT COUNT(*) FROM "leads" WHERE "leads"."status" NOT IN ('Managed', 'Lost')
SELECT "reservations".* FROM "reservations" ORDER BY "reservations"."created_at" DESC LIMIT 6
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" IN (12, 11)
SELECT COUNT(*) AS "count_all", "leads"."status" AS "leads_status" FROM "leads" GROUP BY "leads"."status"
SELECT "admin_actions".* FROM "admin_actions" ORDER BY "admin_actions"."created_at" DESC LIMIT 8
SELECT "users".* FROM "users" WHERE "users"."id" IN (6, 5)
---
    def index
      @vehicles_count = Vehicle.count
      @pending_requests = Reservation.where(status: "pending").count
      @active_rentals = Reservation.where(status: "active").count
      @overdue_returns = Reservation.where(status: "active").where("dropoff_date < ?", Date.current).count
      @maintenance_alerts = MaintenanceLog.where(status: ["Scheduled", "Overdue"]).where("scheduled_on <= ?", Date.current + 7.days).count
      @deposits_paid = Reservation.where(deposit_status: "Paid").sum(:deposit_amount)
      @monthly_revenue = Payment.where(status: "Paid", paid_at: Time.current.beginning_of_month..Time.current.end_of_month).sum(:amount)
      @utilization = Vehicle.count.zero? ? 0 : (Vehicle.all.sum(&:utilization_percent) / Vehicle.count)
      @open_leads = Lead.where.not(status: ["Managed", "Lost"]).count
      @recent_reservations = Reservation.includes(:vehicle).order(created_at: :desc).limit(6)
      @lead_pipeline = Lead.group(:status).count
      @recent_activity = AdminAction.includes(:user).order(created_at: :desc).limit(8)