app/controllers/admin/maintenance_logs_controller.rb

    def index
      @maintenance_logs = MaintenanceLog.includes(:vehicle).order(scheduled_on: :asc)
---
SELECT "maintenance_logs".* FROM "maintenance_logs" ORDER BY "maintenance_logs"."scheduled_on" ASC
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" IN (21, 19)