app/controllers/admin/payments_controller.rb

SELECT "payments".* FROM "payments" ORDER BY "payments"."created_at" DESC
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" IN (4, 3)
SELECT "users".* FROM "users" WHERE "users"."id" IN (4, 3)
SELECT SUM("payments"."amount") FROM "payments" LEFT OUTER JOIN "reservations" ON "reservations"."id" = "payments"."reservation_id" LEFT OUTER JOIN "users" ON "users"."id" = "payments"."user_id" WHERE "payments"."status" = 'Paid'
---
    def index
      @payments = Payment.includes(:reservation, :user).order(created_at: :desc)
      @paid_total = @payments.where(status: "Paid").sum(:amount)