app/controllers/admin/reservations_controller.rb

SELECT "reservations".* FROM "reservations" ORDER BY "reservations"."created_at" DESC
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" IN (12, 11)
SELECT "reservations".* FROM "reservations" WHERE "reservations"."status" = 'pending' ORDER BY "reservations"."created_at" DESC
---
    def index
      @status = params[:status]
      @reservations = Reservation.includes(:vehicle).order(created_at: :desc)
      @reservations = @reservations.where(status: @status) if @status.present?