app/controllers/admin/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'admin@j2c.test' LIMIT 1
UPDATE "users" SET "last_login_at" = '2026-05-25 09:40:20.061809', "updated_at" = '2026-05-25 09:40:20.072456' WHERE "users"."id" = 1
INSERT INTO "admin_actions" ("user_id", "action", "resource_type", "resource_id", "ip_address", "metadata", "created_at", "updated_at") VALUES (1, 'admin.login', NULL, NULL, '127.0.0.1', '"{\"path\":\"/admin-portal/session\"}"', '2026-05-25 09:40:20.137609', '2026-05-25 09:40:20.137609') RETURNING "id"
---
    def create
      user = User.find_by(email: params[:email].to_s.strip.downcase)

      if user&.authenticate(params[:password]) && user.admin_access?
        session[:user_id] = user.id
        user.update(last_login_at: Time.current)
        AdminAction.create!(user: user, action: "admin.login", ip_address: request.remote_ip, metadata: { path: request.fullpath }.to_json)