app/controllers/admin/support_tickets_controller.rb

    def index
      @support_tickets = SupportTicket.includes(:user, :reservation).order(created_at: :desc)
---
SELECT "support_tickets".* FROM "support_tickets" ORDER BY "support_tickets"."created_at" DESC