app/controllers/admin/team_controller.rb

SELECT "user_permissions".* FROM "user_permissions" WHERE "user_permissions"."user_id" IN (5, 7, 6, 8)
SELECT "users".* FROM "users" WHERE "users"."role" IN ('support_agent', 'fleet_manager', 'admin', 'super_admin') ORDER BY "users"."role" ASC, "users"."name" ASC
SELECT "permissions".* FROM "permissions" ORDER BY "permissions"."category" ASC, "permissions"."key" ASC
SELECT "admin_invitations".* FROM "admin_invitations" ORDER BY "admin_invitations"."created_at" DESC LIMIT 12
---
    def index
      @admins = User.where(role: User::ROLES - ["customer"]).includes(:permissions).order(:role, :name)
      @permissions = Permission.order(:category, :key)
      @invitation = AdminInvitation.new(role: "support_agent")
      @invitations = AdminInvitation.order(created_at: :desc).limit(12)