app/controllers/admin/vehicles_controller.rb

    def index
      @vehicles = Vehicle.order(created_at: :desc)
---
SELECT "vehicles".* FROM "vehicles" ORDER BY "vehicles"."created_at" DESC

    def create
      @vehicle = Vehicle.new(vehicle_params)
      if @vehicle.save
---
INSERT INTO "vehicles" ("name", "make", "model", "year", "category", "seats", "doors", "transmission", "fuel", "drivetrain", "location", "daily_rate", "rating", "image_url", "hero_color", "mileage", "luggage", "featured", "available", "description", "created_at", "updated_at") VALUES ('Audi', 'Audi ', 'A4', 2016, 'Luxury', 5, 4, 'Manual', 'Diesel', '60000', 'Goa Panaji', 6000.0, NULL, '', '#51c3d2', '12', 400, TRUE, TRUE, '', '2026-05-25 10:37:59.633086', '2026-05-25 10:37:59.633086') RETURNING "id"

    def set_vehicle
      @vehicle = Vehicle.find(params[:id])
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = 32 LIMIT 1