app/views/admin/reservations/index.html.erb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."status" = 'pending' ORDER BY "reservations"."created_at" DESC
---
    <%= link_to "All", admin_reservations_path %>
    <% Reservation::STATUSES.each do |status| %>