app/views/admin/maintenance_logs/index.html.erb

    <%= form_with model: [:admin, @maintenance_log], class: "admin-form" do |form| %>
      <label>Vehicle <%= form.collection_select :vehicle_id, Vehicle.order(:name), :id, :name %></label>
---
SELECT "vehicles".* FROM "vehicles" ORDER BY "vehicles"."name" ASC