app/controllers/home_controller.rb

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."featured" = TRUE LIMIT 4
---
  def index
    @featured_vehicles = Vehicle.featured.limit(4)