app/controllers/reservations_controller.rb

  def new
    @vehicle = Vehicle.find(params[:vehicle_id])
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = 6 LIMIT 1

  def create
    @vehicle = Vehicle.find(params[:vehicle_id])
    @reservation = @vehicle.reservations.new(reservation_params.merge(user: current_user))

    if @reservation.save
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = 25 LIMIT 1
INSERT INTO "reservations" ("vehicle_id", "first_name", "last_name", "email", "phone", "pickup_location", "dropoff_location", "pickup_date", "dropoff_date", "pickup_time", "dropoff_time", "driver_age", "protection_plan", "extras", "status", "confirmation_code", "total_price", "notes", "created_at", "updated_at", "deposit_amount", "deposit_status", "document_status", "admin_notes", "reviewed_at", "reviewed_by", "user_id", "coupon_id", "cancelled_at", "cancellation_reason", "invoice_number", "pricing_snapshot") VALUES (25, 'Ram', 'Ram', 'abhishek@ram.com', '9340qwrqwerqwerqwerqwerqwe', 'Gurugram Cyber City', 'Bengaluru Indiranagar', '2026-05-26', '2026-05-29', '10:00', '10:00', 28, 'Plus', '[]', 'pending', 'J2C26QALP', 7496.0, '', '2026-05-25 10:21:42.051424', '2026-05-25 10:21:42.051424', 2199.0, 'Pending', 'Pending review', NULL, NULL, NULL, 6, NULL, NULL, NULL, 'INV-202605-5MNTE', '{"daily_rate":"2199.0","days":3,"protection":899,"extras":[],"extra_total":0,"discount":"0.0"}') RETURNING "id"

  def show
    @reservation = Reservation.find_by!(confirmation_code: params[:id])
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."confirmation_code" = 'J2C26QALP' LIMIT 1

  def find
    @reservation = Reservation.find_by(confirmation_code: params[:confirmation_code].to_s.strip.upcase)
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."confirmation_code" = 'J2C26QALP' LIMIT 1