app/controllers/vehicles_controller.rb

  def show
    @vehicle = Vehicle.find(params[:id])
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = 6 LIMIT 1