app/views/admin/coupons/index.html.erb

      <label>Code <%= form.text_field :code, placeholder: "WEEKEND15" %></label>
      <label>Type <%= form.select :discount_type, Coupon::DISCOUNT_TYPES %></label>
---
SELECT "coupons".* FROM "coupons" ORDER BY "coupons"."created_at" DESC